
## Plan Result (shareable-lists-api-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/16664)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 10 to add, 3 to change, 12 to destroy.</code></pre>

* Create
  * aws_s3_bucket_acl.sqs-event-consumer_lambda_code-bucket-acl_8FA13E85
  * aws_s3_bucket_ownership_controls.sqs-event-consumer_lambda_code-bucket-ownership-controls_E3CCA008
  * local_file.application_ecs_service_appspec_94386B9C
  * pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5
  * pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C
  * pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23
  * pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197
* Update
  * aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99
  * aws_iam_policy.synthetics_synthetics_synthetic_check_access_policy_9A7D8849
  * aws_s3_bucket.synthetics_synthetics_synthetic_check_artifacts_53DD59E6
* Delete
  * aws_codepipeline.shareablelistsapi_codepipeline_codepipeline_28C6CBF0
  * aws_iam_role.shareablelistsapi_codepipeline_codepipelinerole_7E4E0BE0
  * aws_iam_role_policy.shareablelistsapi_codepipeline_codepipelinerolepolicy_0CCD3806
  * aws_s3_bucket.shareablelistsapi_codepipeline_codepipelinebucket_FCB048D1
  * null_resource.shareablelistsapi_application_ecsservice_createtaskdefinitionfile_3E3BD94B
  * pagerduty_service_integration.shareablelistsapi_pagerduty_shareablelistsapipagerdutycloudwatch5B0612B4critical_CB12E4FA
  * pagerduty_service_integration.shareablelistsapi_pagerduty_shareablelistsapipagerdutycloudwatch5B0612B4noncritical_44B23D32
  * pagerduty_service_integration.shareablelistsapi_pagerduty_shareablelistsapipagerdutysentryF8EA21CAcritical_E3A8B99A
  * pagerduty_service_integration.shareablelistsapi_pagerduty_shareablelistsapipagerdutysentryF8EA21CAnoncritical_24D72AE9
* Replace
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4
  * aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84
  * aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B
* Move
  * aws_acm_certificate.shareablelistsapi_application_albcertificate_16D0AC5F => aws_acm_certificate.application_alb_certificate_93966247
  * aws_acm_certificate_validation.shareablelistsapi_application_albcertificate_certificatevalidation_CD0411A9 => aws_acm_certificate_validation.application_alb_certificate_certificate_validation_25DAB195
  * aws_alb.shareablelistsapi_application_applicationloadbalancer_alb_D21B8F9E => aws_alb.application_application_load_balancer_alb_05EA9801
  * aws_alb_listener.shareablelistsapi_application_listenerhttp_11652C55 => aws_alb_listener.application_listener_http_D74EC0ED
  * aws_alb_listener.shareablelistsapi_application_listenerhttps_8756E9EA => aws_alb_listener.application_listener_https_D31CB055
  * aws_alb_listener_rule.shareablelistsapi_application_ecsservice_listenerrule_A87D9FA0 => aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F
  * aws_alb_target_group.shareablelistsapi_application_ecsservice_bluetargetgroup_ecstargetgroup_B5DF889A => aws_alb_target_group.application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B
  * aws_alb_target_group.shareablelistsapi_application_ecsservice_greentargetgroup_ecstargetgroup_86700D80 => aws_alb_target_group.application_ecs_service_green_target_group_ecs_target_group_4E06DCA6
  * aws_appautoscaling_policy.shareablelistsapi_application_autoscaling_scaleinpolicy_3E6E2520 => aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511
  * aws_appautoscaling_policy.shareablelistsapi_application_autoscaling_scaleoutpolicy_CCE1AF0A => aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2
  * aws_appautoscaling_target.shareablelistsapi_application_autoscaling_autoscalingtarget_E02FBB66 => aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99
  * aws_cloudwatch_dashboard.shareablelistsapi_application_cloudwatchdashboard_6F3AF2A1 => aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED
  * aws_cloudwatch_log_group.shareablelistsapi_apploggroup_FE92BB40 => aws_cloudwatch_log_group.app-log-group
  * aws_cloudwatch_log_group.shareablelistsapi_sqseventconsumer_lambda_loggroup_CF463F81 => aws_cloudwatch_log_group.sqs-event-consumer_lambda_log-group_A465ADCF
  * aws_cloudwatch_metric_alarm.shareablelistsapi_application_autoscaling_scaleinalarm_E6889998 => aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1
  * aws_cloudwatch_metric_alarm.shareablelistsapi_application_autoscaling_scaleoutalarm_FDB86BEC => aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0
  * aws_cloudwatch_metric_alarm.shareablelistsapi_synthetics_syntheticssyntheticcheckalarmquery0_DD79C9DF => aws_cloudwatch_metric_alarm.synthetics_synthetics_synthetic_check_alarm_query_0_52F9FF21
  * aws_cloudwatch_metric_alarm.shareablelistsapi_synthetics_syntheticssyntheticcheckalarmuptime0_EB60A19B => aws_cloudwatch_metric_alarm.synthetics_synthetics_synthetic_check_alarm_uptime_0_3A56DFC7
  * aws_codedeploy_app.shareablelistsapi_application_ecsservice_ecscodedeploy_ecscodedeploy_22143DD6 => aws_codedeploy_app.application_ecs_service_ecs_codedeploy_ecs_code_deploy_C2F7CBCF
  * aws_codedeploy_app.shareablelistsapi_sqseventconsumer_lambdacodedeploy_codedeployapp_E581B6A5 => aws_codedeploy_app.sqs-event-consumer_lambda-code-deploy_code-deploy-app_71E01125
  * aws_codedeploy_deployment_group.shareablelistsapi_application_ecsservice_ecscodedeploy_ecscodedeploydeploymentgroup_10D3A27D => aws_codedeploy_deployment_group.application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247
  * aws_codedeploy_deployment_group.shareablelistsapi_sqseventconsumer_lambdacodedeploy_codedeploymentgroup_90355DBC => aws_codedeploy_deployment_group.sqs-event-consumer_lambda-code-deploy_code-deployment-group_35D3D807
  * aws_codestarnotifications_notification_rule.shareablelistsapi_application_ecsservice_ecscodedeploy_ecscodedeploynotifications_E67526BA => aws_codestarnotifications_notification_rule.application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_CB44EADE
  * aws_db_subnet_group.shareablelistsapi_rds_rdssubnetgroup_FD1379EC => aws_db_subnet_group.rds_rds_subnet_group_796D20B7
  * aws_ecr_lifecycle_policy.shareablelistsapi_application_ecsservice_ecrapp_ecrrepolifecyclepolicy_941E50F0 => aws_ecr_lifecycle_policy.application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_CCDF75B7
  * aws_ecr_repository.shareablelistsapi_application_ecsservice_ecrapp_ecrrepo_C08D0BC1 => aws_ecr_repository.application_ecs_service_ecr-app_ecr-repo_ABFE17F0
  * aws_ecs_cluster.shareablelistsapi_application_ecscluster_8058A64D => aws_ecs_cluster.application_ecs_cluster_4DC6EFB3
  * aws_ecs_service.shareablelistsapi_application_ecsservice_ecsservice_2190E2FD => aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4
  * aws_ecs_task_definition.shareablelistsapi_application_ecsservice_ecstask_47F6E780 => aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4
  * aws_elasticache_replication_group.shareablelistsapi_redis_elasticachereplicationgroup_FE8E414F => aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446
  * aws_elasticache_subnet_group.shareablelistsapi_redis_elasticachesubnetgroup_5CD502F0 => aws_elasticache_subnet_group.redis_elasticache_subnet_group_EA2B92B2
  * aws_iam_policy.shareablelistsapi_application_ecsservice_ecsiam_ecstaskexecutionrolepolicy_EF6F0F82 => aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77
  * aws_iam_policy.shareablelistsapi_application_ecsservice_ecsiam_ecstaskrolepolicy_CC294C4B => aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6
  * aws_iam_policy.shareablelistsapi_sqseventconsumer_lambda_executionpolicy_7680C818 => aws_iam_policy.sqs-event-consumer_lambda_execution-policy_4069CEFE
  * aws_iam_policy.shareablelistsapi_sqseventconsumer_sqspolicy_2816F022 => aws_iam_policy.sqs-event-consumer_sqs-policy_9FE8B4E1
  * aws_iam_policy.shareablelistsapi_synthetics_syntheticssyntheticcheckaccesspolicy_462E9134 => aws_iam_policy.synthetics_synthetics_synthetic_check_access_policy_9A7D8849
  * aws_iam_role.shareablelistsapi_application_ecsservice_ecsiam_ecsexecutionrole_3870DFB8 => aws_iam_role.application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA
  * aws_iam_role.shareablelistsapi_application_ecsservice_ecsiam_ecstaskrole_49A1729F => aws_iam_role.application_ecs_service_ecs-iam_ecs-task-role_A72990ED
  * aws_iam_role.shareablelistsapi_application_ecsservice_ecscodedeploy_ecscodedeployrole_04B4D89E => aws_iam_role.application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_175DB7D3
  * aws_iam_role.shareablelistsapi_sqseventconsumer_lambdacodedeploy_codedeployrole_6CCA784B => aws_iam_role.sqs-event-consumer_lambda-code-deploy_code-deploy-role_9A627C46
  * aws_iam_role.shareablelistsapi_sqseventconsumer_lambda_executionrole_419895BB => aws_iam_role.sqs-event-consumer_lambda_execution-role_971EF5C2
  * aws_iam_role.shareablelistsapi_synthetics_syntheticcheckrole_025DED3B => aws_iam_role.synthetics_synthetic_check_role_A3A5C38B
  * aws_iam_role_policy_attachment.shareablelistsapi_application_ecsservice_ecsiam_ecstaskcustomattachment_C423ECC4 => aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355
  * aws_iam_role_policy_attachment.shareablelistsapi_application_ecsservice_ecsiam_ecstaskexecutioncustomattachment_2CA888B4 => aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E
  * aws_iam_role_policy_attachment.shareablelistsapi_application_ecsservice_ecsiam_ecstaskexecutiondefaultattachment_634F1CAC => aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF
  * aws_iam_role_policy_attachment.shareablelistsapi_application_ecsservice_ecscodedeploy_ecscodedeployroleattachment_9AB654C9 => aws_iam_role_policy_attachment.application_ecs_service_ecs_codedeploy_ecs_codedeploy_role_attachment_1A1D5725
  * aws_iam_role_policy_attachment.shareablelistsapi_sqseventconsumer_executionrolepolicyattachment_FBCB65BE => aws_iam_role_policy_attachment.sqs-event-consumer_execution-role-policy-attachment_2A5E0086
  * aws_iam_role_policy_attachment.shareablelistsapi_sqseventconsumer_lambdacodedeploy_codedeploypolicyattachment_74367600 => aws_iam_role_policy_attachment.sqs-event-consumer_lambda-code-deploy_code-deploy-policy-attachment_5F4F021D
  * aws_iam_role_policy_attachment.shareablelistsapi_sqseventconsumer_lambda_executionrolepolicyattachment_ACC12E01 => aws_iam_role_policy_attachment.sqs-event-consumer_lambda_execution-role-policy-attachment_B4842CE7
  * aws_iam_role_policy_attachment.shareablelistsapi_synthetics_syntheticssyntheticcheckaccessattach_704D3C97 => aws_iam_role_policy_attachment.synthetics_synthetics_synthetic_check_access_attach_BC7F9559
  * aws_lambda_alias.shareablelistsapi_sqseventconsumer_lambda_alias_F79ED75B => aws_lambda_alias.sqs-event-consumer_lambda_alias_8B8F9784
  * aws_lambda_event_source_mapping.shareablelistsapi_sqseventconsumer_lambdaeventsourcemapping_150176D7 => aws_lambda_event_source_mapping.sqs-event-consumer_lambda_event_source_mapping_5E8B497D
  * aws_lambda_function.shareablelistsapi_sqseventconsumer_lambda_C7C8DA6D => aws_lambda_function.sqs-event-consumer_lambda_477DAF53
  * aws_rds_cluster.shareablelistsapi_rds_rdscluster_84917A20 => aws_rds_cluster.rds_rds_cluster_1A0399FD
  * aws_route53_record.shareablelistsapi_application_albcertificate_certificaterecord_44278480 => aws_route53_record.application_alb_certificate_certificate_record_51B45CF2
  * aws_route53_record.shareablelistsapi_application_albrecord_ABD27B60 => aws_route53_record.application_alb_record_8EA9D3F9
  * aws_route53_record.shareablelistsapi_application_basedns_subhostedzonens_8FDB98AF => aws_route53_record.application_base_dns_subhosted_zone_ns_DFB88A22
  * aws_route53_zone.shareablelistsapi_application_basedns_subhostedzone_AAA0FACC => aws_route53_zone.application_base_dns_subhosted_zone_77521D1C
  * aws_s3_bucket.shareablelistsapi_sqseventconsumer_lambda_codebucket_639AACC1 => aws_s3_bucket.sqs-event-consumer_lambda_code-bucket_DA349A4E
  * aws_s3_bucket.shareablelistsapi_synthetics_syntheticssyntheticcheckartifacts_0A5CAD9A => aws_s3_bucket.synthetics_synthetics_synthetic_check_artifacts_53DD59E6
  * aws_s3_bucket_lifecycle_configuration.shareablelistsapi_synthetics_syntheticssyntheticcheckartifactslifecycle_EEA30BBD => aws_s3_bucket_lifecycle_configuration.synthetics_synthetics_synthetic_check_artifacts_lifecycle_5A7B9150
  * aws_s3_bucket_public_access_block.shareablelistsapi_sqseventconsumer_lambda_codebucketpublicaccessblock_9B2847BA => aws_s3_bucket_public_access_block.sqs-event-consumer_lambda_code-bucket-public-access-block_BB3EE815
  * aws_secretsmanager_secret.shareablelistsapi_rds_rdssecret_C2476124 => aws_secretsmanager_secret.rds_rds_secret_A0401B27
  * aws_secretsmanager_secret_version.shareablelistsapi_rds_rdssecretversion_FABABDE4 => aws_secretsmanager_secret_version.rds_rds_secret_version_11D8C2B1
  * aws_security_group.shareablelistsapi_application_applicationloadbalancer_albsecuritygroup_006EA61D => aws_security_group.application_application_load_balancer_alb_security_group_7B45D070
  * aws_security_group.shareablelistsapi_application_ecsservice_ecssecuritygroup_0CD2F3E6 => aws_security_group.application_ecs_service_ecs_security_group_231C6B1E
  * aws_security_group.shareablelistsapi_rds_rdssecuritygroup_10543BBE => aws_security_group.rds_rds_security_group_B7738CEB
  * aws_security_group.shareablelistsapi_redis_elasticachesecuritygroup_C8337208 => aws_security_group.redis_elasticache_security_group_24BFB83E
  * aws_sns_topic.shareablelistsapi_pagerduty_alarmcriticaltopic_89F8C6AE => aws_sns_topic.pagerduty_alarm-critical-topic_F1534579
  * aws_sns_topic.shareablelistsapi_pagerduty_alarmnoncriticaltopic_44A27670 => aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3
  * aws_sns_topic_subscription.shareablelistsapi_pagerduty_alarmcriticalsubscription_670D825B => aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84
  * aws_sns_topic_subscription.shareablelistsapi_pagerduty_alarmnoncriticalsubscription_784DA2CB => aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B
  * aws_sns_topic_subscription.shareablelistsapi_usereventssnssubscription_B3302FDE => aws_sns_topic_subscription.user-events-sns-subscription_EE3E7438
  * aws_sqs_queue.shareablelistsapi_sqseventconsumer_lambdasqsqueue_56C47C9A => aws_sqs_queue.sqs-event-consumer_lambda_sqs_queue_0D24AF25
  * aws_sqs_queue.shareablelistsapi_sqseventconsumer_lambdasqsqueue_redrivesqsqueue_3467D4BA => aws_sqs_queue.sqs-event-consumer_lambda_sqs_queue_redrive_sqs_queue_CCE99119
  * aws_sqs_queue.shareablelistsapi_usereventssnssubscription_snstopicdql_635CB492 => aws_sqs_queue.user-events-sns-subscription_sns-topic-dql_E3EC76B2
  * aws_sqs_queue_policy.shareablelistsapi_usereventssnssubscription_snsdlqpolicy_A97C45D7 => aws_sqs_queue_policy.user-events-sns-subscription_sns-dlq-policy_CF731C06
  * aws_sqs_queue_policy.shareablelistsapi_usereventssnssubscription_snssqspolicy_31AE2D11 => aws_sqs_queue_policy.user-events-sns-subscription_sns-sqs-policy_C14BCCA0
  * aws_synthetics_canary.shareablelistsapi_synthetics_syntheticssyntheticcheckquery0_0DF36B9C => aws_synthetics_canary.synthetics_synthetics_synthetic_check_query_0_99E4AE1B
  * aws_synthetics_canary.shareablelistsapi_synthetics_syntheticssyntheticcheckuptime0_5C8C5503 => aws_synthetics_canary.synthetics_synthetics_synthetic_check_uptime_0_4168D0DB
  * pagerduty_service.shareablelistsapi_pagerduty_pagerdutycritical_CA569663 => pagerduty_service.pagerduty_pagerduty-critical_464EE7CD
  * pagerduty_service.shareablelistsapi_pagerduty_pagerdutynoncritical_F5BDD663 => pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.aws_iam_policy_document.synthetics_synthetics_synthetic_check_access_4C83FECF will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "synthetics_synthetics_synthetic_check_access_4C83FECF" {
      + id      = (known after apply)
      + json    = (known after apply)
      + version = "2012-10-17"

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::pocket-shareablelistsapi-prod-synthetic-checks/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::pocket-syntheticchecks-prod/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetBucketLocation",
            ]
          + resources = [
              + "arn:aws:s3:::pocket-shareablelistsapi-prod-synthetic-checks",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListAllMyBuckets",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "cloudwatch:PutMetricData",
            ]
          + resources = [
              + "*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "CloudWatchSynthetics",
                ]
              + variable = "cloudwatch:namespace"
            }
        }
      + statement {
          + actions   = [
              + "ec2:AttachNetworkInterface",
              + "ec2:CreateNetworkInterface",
              + "ec2:DeleteNetworkInterface",
              + "ec2:DescribeNetworkInterfaces",
            ]
          + resources = [
              + "*",
            ]
        }
    }

  # aws_acm_certificate.shareablelistsapi_application_albcertificate_16D0AC5F has moved to aws_acm_certificate.application_alb_certificate_93966247
    resource "aws_acm_certificate" "application_alb_certificate_93966247" {
        id                        = "arn:aws:acm:us-east-1:996905175585:certificate/4b6f50cd-5dae-4c50-95e2-2971a3b3a154"
        tags                      = {
            "environment" = "Prod"
            "service"     = "ShareableListsApi"
        }
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_acm_certificate_validation.shareablelistsapi_application_albcertificate_certificatevalidation_CD0411A9 has moved to aws_acm_certificate_validation.application_alb_certificate_certificate_validation_25DAB195
    resource "aws_acm_certificate_validation" "application_alb_certificate_certificate_validation_25DAB195" {
        id                      = "0001-01-01 00:00:00 +0000 UTC"
        # (2 unchanged attributes hidden)
    }

  # aws_alb.shareablelistsapi_application_applicationloadbalancer_alb_D21B8F9E has moved to aws_alb.application_application_load_balancer_alb_05EA9801
    resource "aws_alb" "application_application_load_balancer_alb_05EA9801" {
        id                                          = "arn:aws:elasticloadbalancing:us-east-1:996905175585:loadbalancer/app/SLAPI2023020618400918120000000c/8ac043af9d2b4fc1"
        name                                        = "SLAPI2023020618400918120000000c"
        tags                                        = {
            "environment" = "Prod"
            "service"     = "ShareableListsApi"
        }
        # (23 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # aws_alb_listener.shareablelistsapi_application_listenerhttp_11652C55 has moved to aws_alb_listener.application_listener_http_D74EC0ED
    resource "aws_alb_listener" "application_listener_http_D74EC0ED" {
        id                = "arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/SLAPI2023020618400918120000000c/8ac043af9d2b4fc1/39c15541b3ca931a"
        tags              = {
            "environment" = "Prod"
            "service"     = "ShareableListsApi"
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_alb_listener.shareablelistsapi_application_listenerhttps_8756E9EA has moved to aws_alb_listener.application_listener_https_D31CB055
    resource "aws_alb_listener" "application_listener_https_D31CB055" {
        id                = "arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/SLAPI2023020618400918120000000c/8ac043af9d2b4fc1/857e2ee02b6d462e"
        tags              = {
            "environment" = "Prod"
            "service"     = "ShareableListsApi"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_alb_listener_rule.shareablelistsapi_application_ecsservice_listenerrule_A87D9FA0 has moved to aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F
    resource "aws_alb_listener_rule" "application_ecs_service_listener_rule_903F815F" {
        id           = "arn:aws:elasticloadbalancing:us-east-1:996905175585:listener-rule/app/SLAPI2023020618400918120000000c/8ac043af9d2b4fc1/857e2ee02b6d462e/b7e8f28d129fe4a0"
        tags         = {
            "environment" = "Prod"
            "service"     = "ShareableListsApi"
        }
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_alb_target_group.shareablelistsapi_application_ecsservice_bluetargetgroup_ecstargetgroup_B5DF889A has moved to aws_alb_target_group.application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B
    resource "aws_alb_target_group" "application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B" {
        id                                 = "arn:aws:elasticloadbalancing:us-east-1:996905175585:targetgroup/SLAPIb20230206184007265200000004/24e274b59ba8b3c3"
        name                               = "SLAPIb20230206184007265200000004"
        tags                               = {
            "environment" = "Prod"
            "service"     = "ShareableListsApi"
            "type"        = "blue"
        }
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_alb_target_group.shareablelistsapi_application_ecsservice_greentargetgroup_ecstargetgroup_86700D80 has moved to aws_alb_target_group.application_ecs_service_green_target_group_ecs_target_group_4E06DCA6
    resource "aws_alb_target_group" "application_ecs_service_green_target_group_ecs_target_group_4E06DCA6" {
        id                                 = "arn:aws:elasticloadbalancing:us-east-1:996905175585:targetgroup/SLAPIg20230206184007519100000007/0fa26693fa982ad1"
        name                               = "SLAPIg20230206184007519100000007"
        tags                               = {
            "environment" = "Prod"
            "service"     = "ShareableListsApi"
            "type"        = "green"
        }
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_appautoscaling_policy.shareablelistsapi_application_autoscaling_scaleinpolicy_3E6E2520 has moved to aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511
    resource "aws_appautoscaling_policy" "application_autoscaling_scale_in_policy_BF273511" {
        id                 = "ShareableListsApi-Prod-ScaleInPolicy"
        name               = "ShareableListsApi-Prod-ScaleInPolicy"
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_appautoscaling_policy.shareablelistsapi_application_autoscaling_scaleoutpolicy_CCE1AF0A has moved to aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2
    resource "aws_appautoscaling_policy" "application_autoscaling_scale_out_policy_D03900A2" {
        id                 = "ShareableListsApi-Prod-ScaleOutPolicy"
        name               = "ShareableListsApi-Prod-ScaleOutPolicy"
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99 will be updated in-place
  # (moved from aws_appautoscaling_target.shareablelistsapi_application_autoscaling_autoscalingtarget_E02FBB66)
  ~ resource "aws_appautoscaling_target" "application_autoscaling_autoscaling_target_42BF5C99" {
        id                 = "service/ShareableListsApi-Prod/ShareableListsApi-Prod"
      ~ max_capacity       = 10 -> 5
        tags               = {}
        # (7 unchanged attributes hidden)
    }

  # aws_cloudwatch_dashboard.shareablelistsapi_application_cloudwatchdashboard_6F3AF2A1 has moved to aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED
    resource "aws_cloudwatch_dashboard" "application_cloudwatch-dashboard_1F3DC0ED" {
        id             = "ShareableListsApi-Prod"
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.shareablelistsapi_apploggroup_FE92BB40 has moved to aws_cloudwatch_log_group.app-log-group
    resource "aws_cloudwatch_log_group" "app-log-group" {
        id                = "/Backend/ShareableListsApi-Prod/ecs/app"
        name              = "/Backend/ShareableListsApi-Prod/ecs/app"
        tags              = {
            "environment" = "Prod"
            "service"     = "ShareableListsApi"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.shareablelistsapi_sqseventconsumer_lambda_loggroup_CF463F81 has moved to aws_cloudwatch_log_group.sqs-event-consumer_lambda_log-group_A465ADCF
    resource "aws_cloudwatch_log_group" "sqs-event-consumer_lambda_log-group_A465ADCF" {
        id                = "/aws/lambda/ShareableListsApi-Prod-Sqs-Event-Consumer-Function"
        name              = "/aws/lambda/ShareableListsApi-Prod-Sqs-Event-Consumer-Function"
        tags              = {
            "environment" = "Prod"
            "service"     = "ShareableListsApi"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.shareablelistsapi_application_autoscaling_scaleinalarm_E6889998 has moved to aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1
    resource "aws_cloudwatch_metric_alarm" "application_autoscaling_scale_in_alarm_850BE3A1" {
        id                        = "ShareableListsApi-Prod Service Low CPU"
        tags                      = {
            "environment" = "Prod"
            "service"     = "ShareableListsApi"
        }
        # (18 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.shareablelistsapi_application_autoscaling_scaleoutalarm_FDB86BEC has moved to aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0
    resource "aws_cloudwatch_metric_alarm" "application_autoscaling_scale_out_alarm_E40FCBA0" {
        id                        = "ShareableListsApi-Prod Service High CPU"
        tags                      = {
            "environment" = "Prod"
            "service"     = "ShareableListsApi"
        }
        # (18 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.shareablelistsapi_synthetics_syntheticssyntheticcheckalarmquery0_DD79C9DF has moved to aws_cloudwatch_metric_alarm.synthetics_synthetics_synthetic_check_alarm_query_0_52F9FF21
    resource "aws_cloudwatch_metric_alarm" "synthetics_synthetics_synthetic_check_alarm_query_0_52F9FF21" {
        id                        = "slapi-prod-query-0"
        tags                      = {}
        # (18 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.shareablelistsapi_synthetics_syntheticssyntheticcheckalarmuptime0_EB60A19B has moved to aws_cloudwatch_metric_alarm.synthetics_synthetics_synthetic_check_alarm_uptime_0_3A56DFC7
    resource "aws_cloudwatch_metric_alarm" "synthetics_synthetics_synthetic_check_alarm_uptime_0_3A56DFC7" {
        id                        = "slapi-prod-uptime-0"
        tags                      = {}
        # (18 unchanged attributes hidden)
    }

  # aws_codedeploy_app.shareablelistsapi_application_ecsservice_ecscodedeploy_ecscodedeploy_22143DD6 has moved to aws_codedeploy_app.application_ecs_service_ecs_codedeploy_ecs_code_deploy_C2F7CBCF
    resource "aws_codedeploy_app" "application_ecs_service_ecs_codedeploy_ecs_code_deploy_C2F7CBCF" {
        id               = "9f6ff8a7-12f2-4fb6-a7b0-6ae0fa50c80c:ShareableListsApi-Prod-ECS"
        name             = "ShareableListsApi-Prod-ECS"
        tags             = {
            "environment" = "Prod"
            "service"     = "ShareableListsApi"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_codedeploy_app.shareablelistsapi_sqseventconsumer_lambdacodedeploy_codedeployapp_E581B6A5 has moved to aws_codedeploy_app.sqs-event-consumer_lambda-code-deploy_code-deploy-app_71E01125
    resource "aws_codedeploy_app" "sqs-event-consumer_lambda-code-deploy_code-deploy-app_71E01125" {
        id               = "3897f2b0-8707-4f8f-bbe0-fca352c182c0:ShareableListsApi-Prod-Sqs-Event-Consumer-Lambda"
        name             = "ShareableListsApi-Prod-Sqs-Event-Consumer-Lambda"
        tags             = {}
        # (5 unchanged attributes hidden)
    }

  # aws_codedeploy_deployment_group.shareablelistsapi_application_ecsservice_ecscodedeploy_ecscodedeploydeploymentgroup_10D3A27D has moved to aws_codedeploy_deployment_group.application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247
    resource "aws_codedeploy_deployment_group" "application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247" {
        id                          = "74b499d7-30fa-4051-b882-aadc182bb395"
        tags                        = {
            "environment" = "Prod"
            "service"     = "ShareableListsApi"
        }
        # (10 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_codedeploy_deployment_group.shareablelistsapi_sqseventconsumer_lambdacodedeploy_codedeploymentgroup_90355DBC has moved to aws_codedeploy_deployment_group.sqs-event-consumer_lambda-code-deploy_code-deployment-group_35D3D807
    resource "aws_codedeploy_deployment_group" "sqs-event-consumer_lambda-code-deploy_code-deployment-group_35D3D807" {
        id                          = "9f282b2f-667e-4232-a3fc-9483e5699132"
        tags                        = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_codepipeline.shareablelistsapi_codepipeline_codepipeline_28C6CBF0 will be destroyed
  # (because aws_codepipeline.shareablelistsapi_codepipeline_codepipeline_28C6CBF0 is not in configuration)
  - resource "aws_codepipeline" "shareablelistsapi_codepipeline_codepipeline_28C6CBF0" {
      - arn           = "arn:aws:codepipeline:us-east-1:996905175585:ShareableListsApi-Prod-CodePipeline" -> null
      - id            = "ShareableListsApi-Prod-CodePipeline" -> null
      - name          = "ShareableListsApi-Prod-CodePipeline" -> null
      - pipeline_type = "V1" -> null
      - role_arn      = "arn:aws:iam::996905175585:role/ShareableListsApi-Prod-CodePipelineRole" -> null
      - tags          = {} -> null
      - tags_all      = {} -> null

      - artifact_store {
          - location = "pocket-codepipeline-5e1253f638b8498e526f0800de4e977a" -> null
          - type     = "S3" -> null

          - encryption_key {
              - id   = "arn:aws:kms:us-east-1:996905175585:alias/aws/s3" -> null
              - type = "KMS" -> null
            }
        }

      - stage {
          - name = "Source" -> null

          - action {
              - category         = "Source" -> null
              - configuration    = {
                  - "BranchName"       = "main"
                  - "ConnectionArn"    = "arn:aws:codestar-connections:us-east-1:996905175585:connection/5fa5aa2b-a2d2-43e3-ab5a-72ececfc1870"
                  - "DetectChanges"    = "false"
                  - "FullRepositoryId" = "pocket/shareable-lists-api"
                } -> null
              - input_artifacts  = [] -> null
              - name             = "GitHub_Checkout" -> null
              - namespace        = "SourceVariables" -> null
              - output_artifacts = [
                  - "SourceOutput",
                ] -> null
              - owner            = "AWS" -> null
              - provider         = "CodeStarSourceConnection" -> null
              - run_order        = 1 -> null
              - version          = "1" -> null
            }
        }
      - stage {
          - name = "Deploy" -> null

          - action {
              - category         = "Build" -> null
              - configuration    = {
                  - "EnvironmentVariables" = jsonencode(
                        [
                          - {
                              - name  = "GIT_BRANCH"
                              - value = "#{SourceVariables.BranchName}"
                            },
                        ]
                    )
                  - "ProjectName"          = "ShareableListsApi-Prod"
                } -> null
              - input_artifacts  = [
                  - "SourceOutput",
                ] -> null
              - name             = "Deploy_CDK" -> null
              - output_artifacts = [
                  - "CodeBuildOutput",
                ] -> null
              - owner            = "AWS" -> null
              - provider         = "CodeBuild" -> null
              - run_order        = 1 -> null
              - version          = "1" -> null
            }
          - action {
              - category         = "Deploy" -> null
              - configuration    = {
                  - "AppSpecTemplateArtifact"        = "CodeBuildOutput"
                  - "AppSpecTemplatePath"            = "appspec.json"
                  - "ApplicationName"                = "ShareableListsApi-Prod-ECS"
                  - "DeploymentGroupName"            = "ShareableListsApi-Prod-ECS"
                  - "TaskDefinitionTemplateArtifact" = "CodeBuildOutput"
                  - "TaskDefinitionTemplatePath"     = "taskdef.json"
                } -> null
              - input_artifacts  = [
                  - "CodeBuildOutput",
                ] -> null
              - name             = "Deploy_ECS" -> null
              - output_artifacts = [] -> null
              - owner            = "AWS" -> null
              - provider         = "CodeDeployToECS" -> null
              - run_order        = 2 -> null
              - version          = "1" -> null
            }
        }
    }

  # aws_codestarnotifications_notification_rule.shareablelistsapi_application_ecsservice_ecscodedeploy_ecscodedeploynotifications_E67526BA has moved to aws_codestarnotifications_notification_rule.application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_CB44EADE
    resource "aws_codestarnotifications_notification_rule" "application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_CB44EADE" {
        id             = "arn:aws:codestar-notifications:us-east-1:996905175585:notificationrule/a2f4b152e723ec2e072749a68dc6a2f39f9ffff4"
        name           = "ShareableListsApi-Prod-ECS"
        tags           = {
            "environment" = "Prod"
            "service"     = "ShareableListsApi"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_db_subnet_group.shareablelistsapi_rds_rdssubnetgroup_FD1379EC has moved to aws_db_subnet_group.rds_rds_subnet_group_796D20B7
    resource "aws_db_subnet_group" "rds_rds_subnet_group_796D20B7

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

rsion" "rds_rds_secret_version_11D8C2B1" {
        id             = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ShareableListsApi-Prod/shareablelistsapi-prod20230207160218618400000003-d1m38d|3CDBCF7F-D9F6-4417-9BAF-8A6E0C24D2CA"
        # (5 unchanged attributes hidden)
    }

  # aws_security_group.shareablelistsapi_application_applicationloadbalancer_albsecuritygroup_006EA61D has moved to aws_security_group.application_application_load_balancer_alb_security_group_7B45D070
    resource "aws_security_group" "application_application_load_balancer_alb_security_group_7B45D070" {
        id                     = "sg-026ed6907822b8845"
        name                   = "ShareableListsApi-Prod-HTTP/S Security Group20230206184007507000000006"
        tags                   = {
            "Name"        = "ShareableListsApi-Prod-HTTP/S Security Group"
            "environment" = "Prod"
            "service"     = "ShareableListsApi"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_security_group.shareablelistsapi_application_ecsservice_ecssecuritygroup_0CD2F3E6 has moved to aws_security_group.application_ecs_service_ecs_security_group_231C6B1E
    resource "aws_security_group" "application_ecs_service_ecs_security_group_231C6B1E" {
        id                     = "sg-0ed6d914fcfd795e1"
        name                   = "ShareableListsApi-Prod-ECSSecurityGroup2023020618400918280000000d"
        tags                   = {
            "environment" = "Prod"
            "service"     = "ShareableListsApi"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_security_group.shareablelistsapi_rds_rdssecuritygroup_10543BBE has moved to aws_security_group.rds_rds_security_group_B7738CEB
    resource "aws_security_group" "rds_rds_security_group_B7738CEB" {
        id                     = "sg-04a9d753d1747f551"
        name                   = "ShareableListsApi-Prod20230207160217217800000002"
        tags                   = {
            "environment" = "Prod"
            "service"     = "ShareableListsApi"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_security_group.shareablelistsapi_redis_elasticachesecuritygroup_C8337208 has moved to aws_security_group.redis_elasticache_security_group_24BFB83E
    resource "aws_security_group" "redis_elasticache_security_group_24BFB83E" {
        id                     = "sg-004ca28a73e69b43e"
        name                   = "ShareableListsApi-Prod20230315205033459400000001"
        tags                   = {
            "environment" = "Prod"
            "service"     = "ShareableListsApi"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_sns_topic.shareablelistsapi_pagerduty_alarmcriticaltopic_89F8C6AE has moved to aws_sns_topic.pagerduty_alarm-critical-topic_F1534579
    resource "aws_sns_topic" "pagerduty_alarm-critical-topic_F1534579" {
        id                                       = "arn:aws:sns:us-east-1:996905175585:ShareableListsApi-Prod-Infrastructure-Alarm-Critical"
        name                                     = "ShareableListsApi-Prod-Infrastructure-Alarm-Critical"
        tags                                     = {}
        # (12 unchanged attributes hidden)
    }

  # aws_sns_topic.shareablelistsapi_pagerduty_alarmnoncriticaltopic_44A27670 has moved to aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3
    resource "aws_sns_topic" "pagerduty_alarm-non-critical-topic_53C1A3B3" {
        id                                       = "arn:aws:sns:us-east-1:996905175585:ShareableListsApi-Prod-Infrastructure-Alarm-Non-Critical"
        name                                     = "ShareableListsApi-Prod-Infrastructure-Alarm-Non-Critical"
        tags                                     = {}
        # (12 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84 must be replaced
  # (moved from aws_sns_topic_subscription.shareablelistsapi_pagerduty_alarmcriticalsubscription_670D825B)
-/+ resource "aws_sns_topic_subscription" "pagerduty_alarm-critical-subscription_E2168B84" {
      ~ arn                             = "arn:aws:sns:us-east-1:996905175585:ShareableListsApi-Prod-Infrastructure-Alarm-Critical:bd898818-472f-4201-9b6c-035ba2562a41" -> (known after apply)
      ~ confirmation_was_authenticated  = false -> (known after apply)
      ~ endpoint                        = "https://events.pagerduty.com/integration/6a161f4866d94f0ac0693ed1606d85fb/enqueue" # forces replacement -> (known after apply) # forces replacement
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:us-east-1:996905175585:ShareableListsApi-Prod-Infrastructure-Alarm-Critical:bd898818-472f-4201-9b6c-035ba2562a41" -> (known after apply)
      ~ owner_id                        = "996905175585" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B must be replaced
  # (moved from aws_sns_topic_subscription.shareablelistsapi_pagerduty_alarmnoncriticalsubscription_784DA2CB)
-/+ resource "aws_sns_topic_subscription" "pagerduty_alarm-non-critical-subscription_4702677B" {
      ~ arn                             = "arn:aws:sns:us-east-1:996905175585:ShareableListsApi-Prod-Infrastructure-Alarm-Non-Critical:81337390-9f19-45f4-ae0a-6bc93cb56407" -> (known after apply)
      ~ confirmation_was_authenticated  = false -> (known after apply)
      ~ endpoint                        = "https://events.pagerduty.com/integration/5e2a35d281564703d04ee956892d1e07/enqueue" # forces replacement -> (known after apply) # forces replacement
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:us-east-1:996905175585:ShareableListsApi-Prod-Infrastructure-Alarm-Non-Critical:81337390-9f19-45f4-ae0a-6bc93cb56407" -> (known after apply)
      ~ owner_id                        = "996905175585" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.shareablelistsapi_usereventssnssubscription_B3302FDE has moved to aws_sns_topic_subscription.user-events-sns-subscription_EE3E7438
    resource "aws_sns_topic_subscription" "user-events-sns-subscription_EE3E7438" {
        id                              = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic:f577c3c5-86de-474b-b8d2-db669bce4375"
        # (11 unchanged attributes hidden)
    }

  # aws_sqs_queue.shareablelistsapi_sqseventconsumer_lambdasqsqueue_56C47C9A has moved to aws_sqs_queue.sqs-event-consumer_lambda_sqs_queue_0D24AF25
    resource "aws_sqs_queue" "sqs-event-consumer_lambda_sqs_queue_0D24AF25" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/ShareableListsApi-Prod-Sqs-Event-Consumer-Queue"
        name                              = "ShareableListsApi-Prod-Sqs-Event-Consumer-Queue"
        tags                              = {
            "environment" = "Prod"
            "service"     = "ShareableListsApi"
        }
        # (14 unchanged attributes hidden)
    }

  # aws_sqs_queue.shareablelistsapi_sqseventconsumer_lambdasqsqueue_redrivesqsqueue_3467D4BA has moved to aws_sqs_queue.sqs-event-consumer_lambda_sqs_queue_redrive_sqs_queue_CCE99119
    resource "aws_sqs_queue" "sqs-event-consumer_lambda_sqs_queue_redrive_sqs_queue_CCE99119" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/ShareableListsApi-Prod-Sqs-Event-Consumer-Queue-Deadletter"
        name                              = "ShareableListsApi-Prod-Sqs-Event-Consumer-Queue-Deadletter"
        tags                              = {
            "environment" = "Prod"
            "service"     = "ShareableListsApi"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_sqs_queue.shareablelistsapi_usereventssnssubscription_snstopicdql_635CB492 has moved to aws_sqs_queue.user-events-sns-subscription_sns-topic-dql_E3EC76B2
    resource "aws_sqs_queue" "user-events-sns-subscription_sns-topic-dql_E3EC76B2" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/ShareableListsApi-Prod-SNS-Topic-DLQ"
        name                              = "ShareableListsApi-Prod-SNS-Topic-DLQ"
        tags                              = {
            "environment" = "Prod"
            "service"     = "ShareableListsApi"
        }
        # (13 unchanged attributes hidden)
    }

  # aws_sqs_queue_policy.shareablelistsapi_usereventssnssubscription_snsdlqpolicy_A97C45D7 has moved to aws_sqs_queue_policy.user-events-sns-subscription_sns-dlq-policy_CF731C06
    resource "aws_sqs_queue_policy" "user-events-sns-subscription_sns-dlq-policy_CF731C06" {
        id        = "https://sqs.us-east-1.amazonaws.com/996905175585/ShareableListsApi-Prod-SNS-Topic-DLQ"
        # (2 unchanged attributes hidden)
    }

  # aws_sqs_queue_policy.shareablelistsapi_usereventssnssubscription_snssqspolicy_31AE2D11 has moved to aws_sqs_queue_policy.user-events-sns-subscription_sns-sqs-policy_C14BCCA0
    resource "aws_sqs_queue_policy" "user-events-sns-subscription_sns-sqs-policy_C14BCCA0" {
        id        = "https://sqs.us-east-1.amazonaws.com/996905175585/ShareableListsApi-Prod-Sqs-Event-Consumer-Queue"
        # (2 unchanged attributes hidden)
    }

  # aws_synthetics_canary.shareablelistsapi_synthetics_syntheticssyntheticcheckquery0_0DF36B9C has moved to aws_synthetics_canary.synthetics_synthetics_synthetic_check_query_0_99E4AE1B
    resource "aws_synthetics_canary" "synthetics_synthetics_synthetic_check_query_0_99E4AE1B" {
        id                       = "slapi-prod-query-0"
        name                     = "slapi-prod-query-0"
        tags                     = {}
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_synthetics_canary.shareablelistsapi_synthetics_syntheticssyntheticcheckuptime0_5C8C5503 has moved to aws_synthetics_canary.synthetics_synthetics_synthetic_check_uptime_0_4168D0DB
    resource "aws_synthetics_canary" "synthetics_synthetics_synthetic_check_uptime_0_4168D0DB" {
        id                       = "slapi-prod-uptime-0"
        name                     = "slapi-prod-uptime-0"
        tags                     = {}
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # local_file.application_ecs_service_appspec_94386B9C will be created
  # (moved from local_file.shareablelistsapi_application_ecsservice_appspec_2626BE67)
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

  # null_resource.shareablelistsapi_application_ecsservice_createtaskdefinitionfile_3E3BD94B will be destroyed
  # (because null_resource.shareablelistsapi_application_ecsservice_createtaskdefinitionfile_3E3BD94B is not in configuration)
  - resource "null_resource" "shareablelistsapi_application_ecsservice_createtaskdefinitionfile_3E3BD94B" {
      - id       = "6014471258794508547" -> null
      - triggers = {
          - "alwaysRun" = "2023-10-05T02:19:22Z"
        } -> null
    }

  # pagerduty_service.shareablelistsapi_pagerduty_pagerdutycritical_CA569663 has moved to pagerduty_service.pagerduty_pagerduty-critical_464EE7CD
    resource "pagerduty_service" "pagerduty_pagerduty-critical_464EE7CD" {
        id                      = "PXZPLVP"
        name                    = "ShareableListsApi-Prod-PagerDuty-Critical"
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # pagerduty_service.shareablelistsapi_pagerduty_pagerdutynoncritical_F5BDD663 has moved to pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938
    resource "pagerduty_service" "pagerduty_pagerduty-non-critical_B4CB3938" {
        id                      = "PU01KFM"
        name                    = "ShareableListsApi-Prod-PagerDuty-Non-Critical"
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Amazon CloudWatch"
      + service                 = "PXZPLVP"
      + type                    = (known after apply)
      + vendor                  = "PZQ6AUS"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Amazon CloudWatch"
      + service                 = "PU01KFM"
      + type                    = (known after apply)
      + vendor                  = "PZQ6AUS"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Sentry"
      + service                 = "PXZPLVP"
      + type                    = (known after apply)
      + vendor                  = "PKAPG94"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Sentry"
      + service                 = "PU01KFM"
      + type                    = (known after apply)
      + vendor                  = "PKAPG94"
    }

  # pagerduty_service_integration.shareablelistsapi_pagerduty_shareablelistsapipagerdutycloudwatch5B0612B4critical_CB12E4FA will be destroyed
  # (because pagerduty_service_integration.shareablelistsapi_pagerduty_shareablelistsapipagerdutycloudwatch5B0612B4critical_CB12E4FA is not in configuration)
  - resource "pagerduty_service_integration" "shareablelistsapi_pagerduty_shareablelistsapipagerdutycloudwatch5B0612B4critical_CB12E4FA" {
      - html_url        = "https://mozilla.pagerduty.com/services/PXZPLVP/integrations/P544E3W" -> null
      - id              = "P544E3W" -> null
      - integration_key = "6a161f4866d94f0ac0693ed1606d85fb" -> null
      - name            = "Amazon CloudWatch" -> null
      - service         = "PXZPLVP" -> null
      - type            = "event_transformer_api_inbound_integration" -> null
      - vendor          = "PZQ6AUS" -> null
    }

  # pagerduty_service_integration.shareablelistsapi_pagerduty_shareablelistsapipagerdutycloudwatch5B0612B4noncritical_44B23D32 will be destroyed
  # (because pagerduty_service_integration.shareablelistsapi_pagerduty_shareablelistsapipagerdutycloudwatch5B0612B4noncritical_44B23D32 is not in configuration)
  - resource "pagerduty_service_integration" "shareablelistsapi_pagerduty_shareablelistsapipagerdutycloudwatch5B0612B4noncritical_44B23D32" {
      - html_url        = "https://mozilla.pagerduty.com/services/PU01KFM/integrations/PGEECM0" -> null
      - id              = "PGEECM0" -> null
      - integration_key = "5e2a35d281564703d04ee956892d1e07" -> null
      - name            = "Amazon CloudWatch" -> null
      - service         = "PU01KFM" -> null
      - type            = "event_transformer_api_inbound_integration" -> null
      - vendor          = "PZQ6AUS" -> null
    }

  # pagerduty_service_integration.shareablelistsapi_pagerduty_shareablelistsapipagerdutysentryF8EA21CAcritical_E3A8B99A will be destroyed
  # (because pagerduty_service_integration.shareablelistsapi_pagerduty_shareablelistsapipagerdutysentryF8EA21CAcritical_E3A8B99A is not in configuration)
  - resource "pagerduty_service_integration" "shareablelistsapi_pagerduty_shareablelistsapipagerdutysentryF8EA21CAcritical_E3A8B99A" {
      - html_url        = "https://mozilla.pagerduty.com/services/PXZPLVP/integrations/P1UGDR6" -> null
      - id              = "P1UGDR6" -> null
      - integration_key = "c9450bd5c1b14a01d0c359e1ef5fb1fc" -> null
      - name            = "Sentry" -> null
      - service         = "PXZPLVP" -> null
      - type            = "app_event_transform_inbound_integration" -> null
      - vendor          = "PKAPG94" -> null
    }

  # pagerduty_service_integration.shareablelistsapi_pagerduty_shareablelistsapipagerdutysentryF8EA21CAnoncritical_24D72AE9 will be destroyed
  # (because pagerduty_service_integration.shareablelistsapi_pagerduty_shareablelistsapipagerdutysentryF8EA21CAnoncritical_24D72AE9 is not in configuration)
  - resource "pagerduty_service_integration" "shareablelistsapi_pagerduty_shareablelistsapipagerdutysentryF8EA21CAnoncritical_24D72AE9" {
      - html_url        = "https://mozilla.pagerduty.com/services/PU01KFM/integrations/PKR2DBQ" -> null
      - id              = "PKR2DBQ" -> null
      - integration_key = "c43bc0062e3c4a0cc01e5eeacdde84a3" -> null
      - name            = "Sentry" -> null
      - service         = "PU01KFM" -> null
      - type            = "app_event_transform_inbound_integration" -> null
      - vendor          = "PKAPG94" -> null
    }

Plan: 10 to add, 3 to change, 12 to destroy.
╷
│ Warning: Deprecated attribute
│ 
│   on cdk.tf.json line 3041, in resource.aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84:
│ 3041:         "endpoint": "https://events.pagerduty.com/integration/${pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5.integration_key}/enqueue",
│ 
│ The attribute "integration_key" is deprecated. Refer to the provider
│ documentation for details.
│ 
│ (and 3 more similar warnings elsewhere)
╵
```

</details>



## :warning: Warnings

```hcl
Warning: Deprecated attribute
 
   on cdk.tf.json line 3041, in resource.aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84:
 3041:         "endpoint": "https://events.pagerduty.com/integration/${pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5.integration_key}/enqueue",
 
 The attribute "integration_key" is deprecated. Refer to the provider
 documentation for details.
 
 (and 3 more similar warnings elsewhere)
```



<!-- github-comment: {"Command":"plan","JobID":"504708ec-fba2-4ed5-adcd-d1cf3feaca70","JobName":"shareable-lists-api_infrastructure_plan_prod","PRNumber":84,"Program":"tfcmt","SHA1":"857e73bcb778acd450c1204b3ff519466bc1c135","Target":"shareable-lists-api-cdk","Vars":{}} -->